#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
** Part 1
Each rule will replace one instance, not all, of the left hand side
with the right hand side of the rule in the string. PPCRE is going to
come in handy here. Just exploring some of its features.
#+BEGIN_SRC lisp :exports both
  (ppcre:regex-replace "H" "HOH" "OH")
#+END_SRC

#+RESULTS:
: OHOH

So it can do the substitutions for us to collect. But how to make sure
we do them all, remember we only want *one* substitution, not
all. =regex-replace= can take a start parameter.
#+BEGIN_SRC lisp :exports both
  (ppcre:regex-replace "H" "HOH" "OH" :start 1)
#+END_SRC

#+RESULTS:
: OOH

Ok, not quite what I wanted, that removed the first part so we have to
restore it. That's not too bad. How to find out all the locations to
start at, though?

#+BEGIN_SRC lisp :exports both
  (ppcre:all-matches "H" "HOH")
#+END_SRC

#+RESULTS:
| 0 | 1 | 2 | 3 |

Those should be read off in pairs representing the start and end of
the matches. Keeping in mind that regex-replace with a starting point
cuts off everything before it:

#+BEGIN_SRC lisp :exports both
  (concatenate 'string (subseq "HOH" 0 1) (ppcre:regex-replace "H" "HOH" "OH" :start 1))
#+END_SRC

#+RESULTS:
: HOOH

Closer. Let's try one more thing.
#+BEGIN_SRC lisp :exports both
  (concatenate 'string (subseq "HOH" 0 0) (ppcre:regex-replace "H" "HOH" "OH" :start 0))
#+END_SRC

#+RESULTS:
: OHOH

#+BEGIN_SRC lisp :exports both
  (concatenate 'string (subseq "HOH" 0 0) (ppcre:regex-replace "H" "HOH" "OH" :start 0 :end 1) (subseq "HOH" 1))
#+END_SRC

#+RESULTS:
: OHOH

OK, now let's put it into a loop.
#+BEGIN_SRC lisp :exports both
  (let ((input "HOH")
        (rules '(("H" "OH")
                 ("H" "HO")
                 ("O" "HH"))))
    (iter outer
          (for (lhs rhs) in rules)
          (let ((matches (ppcre:all-matches lhs input)))
            (iter (while matches)
                  (let ((start (pop matches))
                        (end (pop matches)))
                    (in outer
                        (collect
                            (concatenate 'string
                                         (subseq input 0 start)
                                         (ppcre:regex-replace lhs input rhs :start start :end end)
                                         (subseq input end)))))))))
#+END_SRC

#+RESULTS:
| OHOH | HOOH | HOOH | HOHO | HHHH |

Awesome, those are all of them. Now let's make that a function.

#+NAME: all-single-substitutions
#+BEGIN_SRC lisp :results silent
  (defun all-single-substitutions (input rules)
    (remove-duplicates
     (iter outer
           (for (lhs rhs) in rules)
           (let ((matches (ppcre:all-matches lhs input)))
             (iter (while matches)
                   (let ((start (pop matches))
                         (end (pop matches)))
                     (in outer
                         (collect
                             (concatenate 'string
                                          (subseq input 0 start)
                                          (ppcre:regex-replace lhs input rhs :start start :end end)
                                          (subseq input end))))))))
     :test #'equal))
#+END_SRC

#+BEGIN_SRC lisp :exports both
  (all-single-substitutions "HOH" '(("H" "OH")
                                    ("H" "HO")
                                    ("O" "HH")))
#+END_SRC

#+RESULTS:
| OHOH | HOOH | HOHO | HHHH |

Perfect, just 4 like we wanted.

#+NAME: problem-a
#+BEGIN_SRC lisp :noweb yes :results silent
  (defun problem-a () (format t "Problem 19 A: ~a~%" (length (all-single-substitutions (car *input*) (cadr *input*)))))
#+END_SRC
